#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖[32m[1mSuccess![0m The configuration is valid.
[0m

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[1mmodule.cloudflare_uat.data.cloudflare_zones.domain: Reading...[0m[0m
[0m[1mmodule.cloudflare_uat.data.cloudflare_zones.domain: Read complete after 1s [id=710d22e8e4c1cd939d91963ea90420bb][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.cloudflare_uat.cloudflare_record.cname[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "cloudflare_record" "cname" {
      [32m+[0m [0m[1m[0mallow_overwrite[0m[0m = false
      [32m+[0m [0m[1m[0mcreated_on[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mhostname[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mmetadata[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mmodified_on[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m            = "uat"
      [32m+[0m [0m[1m[0mproxiable[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mproxied[0m[0m         = true
      [32m+[0m [0m[1m[0mttl[0m[0m             = 1
      [32m+[0m [0m[1m[0mtype[0m[0m            = "CNAME"
      [32m+[0m [0m[1m[0mvalue[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mzone_id[0m[0m         = "45371d5e2e41b9575d6e48c8c614d895"
    }

[1m  # module.s3_uat.aws_s3_bucket.site[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket" "site" {
      [32m+[0m [0m[1m[0macceleration_status[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0macl[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mbucket[0m[0m                      = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_domain_name[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mbucket_regional_domain_name[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m               = false
      [32m+[0m [0m[1m[0mhosted_zone_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mobject_lock_enabled[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mregion[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mrequest_payer[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                        = {
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Name"            = "uat.marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                    = {
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Name"            = "uat.marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mwebsite_domain[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mwebsite_endpoint[0m[0m            = (known after apply)

      [32m+[0m [0mcors_rule {
          [32m+[0m [0m[1m[0mallowed_headers[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mallowed_methods[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mallowed_origins[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mexpose_headers[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mmax_age_seconds[0m[0m = (known after apply)
        }

      [32m+[0m [0mgrant {
          [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mpermissions[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0muri[0m[0m         = (known after apply)
        }

      [32m+[0m [0mlifecycle_rule {
          [32m+[0m [0m[1m[0mabort_incomplete_multipart_upload_days[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m                                = (known after apply)
          [32m+[0m [0m[1m[0mid[0m[0m                                     = (known after apply)
          [32m+[0m [0m[1m[0mprefix[0m[0m                                 = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m                                   = (known after apply)

          [32m+[0m [0mexpiration {
              [32m+[0m [0m[1m[0mdate[0m[0m                         = (known after apply)
              [32m+[0m [0m[1m[0mdays[0m[0m                         = (known after apply)
              [32m+[0m [0m[1m[0mexpired_object_delete_marker[0m[0m = (known after apply)
            }

          [32m+[0m [0mnoncurrent_version_expiration {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }

          [32m+[0m [0mnoncurrent_version_transition {
              [32m+[0m [0m[1m[0mdays[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mstorage_class[0m[0m = (known after apply)
            }

          [32m+[0m [0mtransition {
              [32m+[0m [0m[1m[0mdate[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mdays[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mstorage_class[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mlogging {
          [32m+[0m [0m[1m[0mtarget_bucket[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtarget_prefix[0m[0m = (known after apply)
        }

      [32m+[0m [0mobject_lock_configuration {
          [32m+[0m [0m[1m[0mobject_lock_enabled[0m[0m = (known after apply)

          [32m+[0m [0mrule {
              [32m+[0m [0mdefault_retention {
                  [32m+[0m [0m[1m[0mdays[0m[0m  = (known after apply)
                  [32m+[0m [0m[1m[0mmode[0m[0m  = (known after apply)
                  [32m+[0m [0m[1m[0myears[0m[0m = (known after apply)
                }
            }
        }

      [32m+[0m [0mreplication_configuration {
          [32m+[0m [0m[1m[0mrole[0m[0m = (known after apply)

          [32m+[0m [0mrules {
              [32m+[0m [0m[1m[0mdelete_marker_replication_status[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
              [32m+[0m [0m[1m[0mprefix[0m[0m                           = (known after apply)
              [32m+[0m [0m[1m[0mpriority[0m[0m                         = (known after apply)
              [32m+[0m [0m[1m[0mstatus[0m[0m                           = (known after apply)

              [32m+[0m [0mdestination {
                  [32m+[0m [0m[1m[0maccount_id[0m[0m         = (known after apply)
                  [32m+[0m [0m[1m[0mbucket[0m[0m             = (known after apply)
                  [32m+[0m [0m[1m[0mreplica_kms_key_id[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mstorage_class[0m[0m      = (known after apply)

                  [32m+[0m [0maccess_control_translation {
                      [32m+[0m [0m[1m[0mowner[0m[0m = (known after apply)
                    }

                  [32m+[0m [0mmetrics {
                      [32m+[0m [0m[1m[0mminutes[0m[0m = (known after apply)
                      [32m+[0m [0m[1m[0mstatus[0m[0m  = (known after apply)
                    }

                  [32m+[0m [0mreplication_time {
                      [32m+[0m [0m[1m[0mminutes[0m[0m = (known after apply)
                      [32m+[0m [0m[1m[0mstatus[0m[0m  = (known after apply)
                    }
                }

              [32m+[0m [0mfilter {
                  [32m+[0m [0m[1m[0mprefix[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mtags[0m[0m   = (known after apply)
                }

              [32m+[0m [0msource_selection_criteria {
                  [32m+[0m [0msse_kms_encrypted_objects {
                      [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
                    }
                }
            }
        }

      [32m+[0m [0mserver_side_encryption_configuration {
          [32m+[0m [0mrule {
              [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m = (known after apply)

              [32m+[0m [0mapply_server_side_encryption_by_default {
                  [32m+[0m [0m[1m[0mkms_master_key_id[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0msse_algorithm[0m[0m     = (known after apply)
                }
            }
        }

      [32m+[0m [0mversioning {
          [32m+[0m [0m[1m[0menabled[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mmfa_delete[0m[0m = (known after apply)
        }

      [32m+[0m [0mwebsite {
          [32m+[0m [0m[1m[0merror_document[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mindex_document[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mredirect_all_requests_to[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mrouting_rules[0m[0m            = (known after apply)
        }
    }

[1m  # module.s3_uat.aws_s3_bucket_acl.site[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_acl" "site" {
      [32m+[0m [0m[1m[0macl[0m[0m    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m     = (known after apply)

      [32m+[0m [0maccess_control_policy {
          [32m+[0m [0mgrant {
              [32m+[0m [0m[1m[0mpermission[0m[0m = (known after apply)

              [32m+[0m [0mgrantee {
                  [32m+[0m [0m[1m[0mdisplay_name[0m[0m  = (known after apply)
                  [32m+[0m [0m[1m[0memail_address[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mid[0m[0m            = (known after apply)
                  [32m+[0m [0m[1m[0mtype[0m[0m          = (known after apply)
                  [32m+[0m [0m[1m[0muri[0m[0m           = (known after apply)
                }
            }

          [32m+[0m [0mowner {
              [32m+[0m [0m[1m[0mdisplay_name[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
            }
        }
    }

[1m  # module.s3_uat.aws_s3_bucket_policy.site[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_policy" "site" {
      [32m+[0m [0m[1m[0mbucket[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m = (known after apply)
    }

[1m  # module.s3_uat.aws_s3_bucket_website_configuration.site[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_website_configuration" "site" {
      [32m+[0m [0m[1m[0mbucket[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrouting_rules[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mwebsite_domain[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mwebsite_endpoint[0m[0m = (known after apply)

      [32m+[0m [0merror_document {
          [32m+[0m [0m[1m[0mkey[0m[0m = "index.html"
        }

      [32m+[0m [0mindex_document {
          [32m+[0m [0m[1m[0msuffix[0m[0m = "index.html"
        }

      [32m+[0m [0mrouting_rule {
          [32m+[0m [0mcondition {
              [32m+[0m [0m[1m[0mhttp_error_code_returned_equals[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mkey_prefix_equals[0m[0m               = (known after apply)
            }

          [32m+[0m [0mredirect {
              [32m+[0m [0m[1m[0mhost_name[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mhttp_redirect_code[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mprotocol[0m[0m                = (known after apply)
              [32m+[0m [0m[1m[0mreplace_key_prefix_with[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mreplace_key_with[0m[0m        = (known after apply)
            }
        }
    }

[0m[1mPlan:[0m 5 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [32m+[0m [0m[1m[0mcloudflare[0m[0m  = {
      [32m+[0m [0mcloudflare_record_cname = {
          [32m+[0m [0mallow_overwrite = false
          [32m+[0m [0mcomment         = [90mnull[0m[0m
          [32m+[0m [0mcreated_on      = (known after apply)
          [32m+[0m [0mdata            = []
          [32m+[0m [0mhostname        = (known after apply)
          [32m+[0m [0mid              = (known after apply)
          [32m+[0m [0mmetadata        = (known after apply)
          [32m+[0m [0mmodified_on     = (known after apply)
          [32m+[0m [0mname            = "uat"
          [32m+[0m [0mpriority        = [90mnull[0m[0m
          [32m+[0m [0mproxiable       = (known after apply)
          [32m+[0m [0mproxied         = true
          [32m+[0m [0mtags            = [90mnull[0m[0m
          [32m+[0m [0mtimeouts        = [90mnull[0m[0m
          [32m+[0m [0mttl             = 1
          [32m+[0m [0mtype            = "CNAME"
          [32m+[0m [0mvalue           = (known after apply)
          [32m+[0m [0mzone_id         = "45371d5e2e41b9575d6e48c8c614d895"
        }
    }
  [32m+[0m [0m[1m[0ms3[0m[0m          = {
      [32m+[0m [0mtags              = {
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Name"            = "uat.marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0mwebsite_bucket_id = (known after apply)
      [32m+[0m [0mwebsite_domain    = (known after apply)
      [32m+[0m [0mwebsite_endpoint  = (known after apply)
    }
  [32m+[0m [0m[1m[0msite_domain[0m[0m = "uat.marshmallowmeat.com"
```

</details>

*Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `Infra`*